"use client";

import SectionTitle from "../common/SectionTitle";

export default function BudgetSummary() {
  return (
    <section className="my-5">
      <SectionTitle title="वार्षिक अर्थसंकल्प" />

      <div className="grid-card light">
        <p>
          ग्रामपंचायतीचा वार्षिक अर्थसंकल्प पारदर्शकतेने तयार केला जातो.
          सर्व उत्पन्न व खर्च याची माहिती नागरिकांसाठी उपलब्ध करून दिली जाते.
        </p>

        {/* UPDATE: replace PDF later */}
        <a href="#" className="btn btn-primary">
          📄 अर्थसंकल्प PDF डाउनलोड
        </a>
      </div>
    </section>
  );
}
